/*
{*****************************************************************************
{  广州医博-基础框架 v1.0													
{  版权信息 (c) 2018-2020 广州医博信息技术有限公司. 保留所有权利.					
{  创建人：  高云
{  审查人：
{  模块：系统管理模块										
{  功能描述:										
{		 													
{  ---------------------------------------------------------------------------	
{  维护历史:													
{  日期        维护人        维护类型						
{  ---------------------------------------------------------------------------	
{  2019-01-07  高云        新建	
{ 	                                                                     
{  ---------------------------------------------------------------------------
{  注：本模块代码由医博代码生成工具辅助生成
{*****************************************************************************	
*/

package cn.yibo.boot.modules.base.service;

import cn.yibo.boot.modules.base.dao.LogDao;
import cn.yibo.boot.modules.base.entity.Log;
import cn.yibo.common.base.service.IBaseService;

/**
 * 操作日志表服务接口层
 * @author 高云
 * @since 2019-01-07
 * @version v1.0
 */
public interface LogService extends IBaseService<LogDao, Log> {
    
}