/*
{*****************************************************************************
{  广州医博-基础框架 v1.0
{  版权信息 (c) 2018-2020 广州医博信息技术有限公司. 保留所有权利.
{  创建人：  高云
{  审查人：
{  模块：核心模块
{  功能描述:
{
{  ---------------------------------------------------------------------------
{  维护历史:
{  日期        维护人        维护类型
{  ---------------------------------------------------------------------------
{  2018-08-10  高云        新建
{
{  ---------------------------------------------------------------------------
{  注：本模块代码为底层基础框架封装的core包
{*****************************************************************************
*/

package cn.yibo.core.protocol;

import java.util.HashMap;

/**
 * 描述: 响应Json Error的Map
 * 作者：高云
 * 邮箱: gogo163gao@163.com
 * 时间: 2018-08-10
 * 版本: v1.0
 */
public class ResponseErrorMap<K,V> extends HashMap<K,V> {

}
