/*
{*****************************************************************************
{  广州医博-基础框架 v1.0
{  版权信息 (c) 2018-2020 广州医博信息技术有限公司. 保留所有权利.
{  创建人：  高云
{  审查人：
{  模块：安全控制模块
{  功能描述:
{
{  ---------------------------------------------------------------------------
{  维护历史:
{  日期        维护人        维护类型
{  ---------------------------------------------------------------------------
{  2018-12-03  高云        新建
{
{  ---------------------------------------------------------------------------
{  注：本模块代码为底层基础框架封装的security包
{*****************************************************************************
*/

package cn.yibo.common.utils.tree;

/**
 * 自定义树搜索器
 * @author abo
 * @param <N> 树节点
 */
public interface BaseTreeSearcher<N> {

    /**
     * 当该方法返回true时,表示匹配到该节点
     * @param node	当前树节点
     * @return
     */
    boolean search(N node);
}